Revit 2027 API
AddInCommandBinding.BeforeExecuted Event
Occurs before the command associated with this AddInCommandBinding executes.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public event EventHandler<BeforeExecutedEventArgs> BeforeExecuted
Public Event BeforeExecuted As EventHandler(Of BeforeExecutedEventArgs)
public:
 event EventHandler<BeforeExecutedEventArgs^>^ BeforeExecuted {
	void add (EventHandler<BeforeExecutedEventArgs^>^ value);
	void remove (EventHandler<BeforeExecutedEventArgs^>^ value);
}
member BeforeExecuted : IEvent<EventHandler<BeforeExecutedEventArgs>,
    BeforeExecutedEventArgs>
Value
EventHandler<BeforeExecutedEventArgs>
See Also
Reference
AddInCommandBinding Class
Autodesk.Revit.UI Namespace